{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report linking a footer content update feature to affected files and components.",
  "frontend-file-summaries.txt": "Contains pre-written summaries of all frontend files for reference.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React component assembling header, sections, and footer into the page layout.",
  "frontend/src/components/Gallery.tsx": "Image gallery component rendering a responsive grid with optional hover titles.",
  "frontend/src/components/Section.tsx": "Wrapper for page sections providing consistent spacing and container layout.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing branding, navigation, and dynamic contact details from siteContent.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with smooth-scrolling navigation and mobile sheet menu.",
  "frontend/src/content/siteContent.ts": "Centralized site text, highlights, gallery data, and contact information.",
  "frontend/src/data/menu.ts": "Menu data defining categories and items with names, descriptions, and prices.",
  "frontend/src/hooks/useActor.ts": "Custom hook creating and managing authenticated or anonymous backend actors using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, and logout methods.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future React Query hooks when backend methods are added.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, typography, and imported fonts.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/sections/AboutSection.tsx": "Renders the About section with story, approach text, and a gallery sourced from siteContent.",
  "frontend/src/sections/ContactSection.tsx": "Implements a contact form with validation and displays business contact info from siteContent.",
  "frontend/src/sections/HeroSection.tsx": "Displays the landing hero with background image, logo, tagline, highlights, and a CTA to scroll to the menu.",
  "frontend/src/sections/MenuSection.tsx": "Renders menu categories and items from menuData with styled cards and pricing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, typography, plugins, and dark mode.",
  "project_state.json": "Contains project metadata, feature requests, and current project state information."
}