{
  "backend/main.mo": "Motoko canister implementing user profiles, order creation and retrieval, and role‑based access control using authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping UI styling and admin order panel requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of core frontend components, sections, styles, hooks, and config files.",
  "frontend/index.css": "Global Tailwind base and theme variables defining light/dark palettes and core CSS resets.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx with favicon and meta settings.",
  "frontend/src/App.tsx": "Main React app layout wiring all site sections, auth sheet, cart provider, header/footer, and initialization hooks.",
  "frontend/src/cart/CartContext.tsx": "React context and reducer managing cart state, item operations, subtotal, and item count.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items and state plus subtotal calculation helper.",
  "frontend/src/cart/useCart.ts": "Hook exposing cart context and enforcing provider usage.",
  "frontend/src/components/AuthSheet.tsx": "Bottom sheet UI for login/logout via Internet Identity with hero image, state handling, and auto‑close behavior.",
  "frontend/src/components/BackendConnectivityBanner.tsx": "Shows a fixed alert banner when the backend is unreachable; stays hidden during initial checks or when connected.",
  "frontend/src/components/CartSheet.tsx": "Provides a slide-in cart panel with item controls, subtotal display, and checkout trigger, synced with global cart state.",
  "frontend/src/components/CheckoutSheet.tsx": "Implements a checkout form with authentication handling, validation, address creation, and order submission via createOrder.",
  "frontend/src/components/Gallery.tsx": "Renders a responsive image grid with hover zoom and optional title overlay.",
  "frontend/src/components/menu/CategoryPill.tsx": "Clickable category pill displaying a thumbnail and name with selected styling.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Menu item card showing image, description, price variants, and an add‑to‑cart action.",
  "frontend/src/components/MobileBottomNav.tsx": "Displays a mobile-only bottom nav with quick scroll links, profile auth handling, and cart badge with open-cart event.",
  "frontend/src/components/OpeningHoursBadge.tsx": "Shows a compact hours badge by deriving a single-line summary from siteContent hours.",
  "frontend/src/components/ProfileSetup.tsx": "Prompts authenticated users missing a profile to enter info, capture location, validate fields, and save their profile.",
  "frontend/src/components/Section.tsx": "Wraps content in a styled section with container and optional class overrides.",
  "frontend/src/components/SiteFooter.tsx": "Displays footer with branding, quick navigation links, contact details, and optional WhatsApp link.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with navigation, auth handling, cart, checkout, and admin access logic.",
  "frontend/src/content/siteContent.ts": "Static site content including hero text, about info, contact details, and gallery data.",
  "frontend/src/data/menu.ts": "Typed menu data structures and full menu listing with categories, items, and price variants.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useBackendConnectivity.ts": "Hook that pings the backend for connectivity status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles and orders using an actor-based backend API with authentication checks and cache invalidation.",
  "frontend/src/hooks/useUserInitialization.ts": "Initializes authenticated users by triggering backend registration and invalidating related queries once per session.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, utility layers, and custom admin and mobile UI styles.",
  "frontend/src/lib/currency.ts": "Provides a simple utility to format numbers as Pakistani Rupees.",
  "frontend/src/lib/orderMapping.ts": "Maps cart items and form fields into backend OrderItem and Address structures.",
  "frontend/src/lib/utils.ts": "Exports a class name merging helper using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/sections/AboutSection.tsx": "Renders the About section with story text, approach details, and a gallery.",
  "frontend/src/sections/admin/AdminOrderCard.tsx": "Shows a summary card for an order with status styling, totals, and a button to view details.",
  "frontend/src/sections/admin/AdminOrderItemsList.tsx": "Renders a list of order items in admin view, showing quantity, pricing, and totals per item.",
  "frontend/src/sections/AdminOrdersSection.tsx": "Admin interface for viewing, filtering, and updating orders with role checks and detailed order dialogs.",
  "frontend/src/sections/ContactSection.tsx": "Displays contact info and a validated contact form with simulated submission.",
  "frontend/src/sections/HeroSection.tsx": "Hero banner with background image, logo, tagline, CTA button, and highlight cards.",
  "frontend/src/sections/MenuSection.tsx": "Renders the menu with category filters and item cards, letting users add items or variants to the cart.",
  "frontend/src/sections/MyOrdersSection.tsx": "Displays the user’s order history with authentication checks, sorting, detailed status UI, and order detail dialogs.",
  "frontend/src/utils/uiEvents.ts": "Implements a simple event bus for emitting and subscribing to UI-only events.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters, including session-backed storage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, radii, animations, and content paths for the project.",
  "project_state.json": "Maintains project metadata, feature definitions, and pending requests for the admin orders panel redesign."
}